# однострочный комментарий

# "Ctrl + /" сочетание клавиш для создания или удаления комментария

'''
многострочный 
коменнтарий
'''


"""
многострочный 
комментарий
"""

# Переменные

# snake_case (змеиная_нотация)
var_1 = 10
number_of_apples = 100

# camelcase (верблюжаяНотация)
myNumVar = 20

# константные переменные (константы)
CONST_VAR = 1000


# встроенная функции вывода в терминал
# print(var_1)
# print(myNumVar)

# print(myNumVar, CONST_VAR, number_of_apples)

# встроенная функция ввода из терминала
# in_1 = input("Введите число: ")
# print(in_1)

# небольшой калькулятор
in_1 = input("Введите 1 число: ")
in_2 = input("Введите 2 число: ")

# конкатенация (объединение) строк
# result = in_1 + in_2

# сложение чисел
result = int(in_1) + int(in_2)

print (result)