# *** Коллекции ***

# Кортеж (tuple)

# Упорядоченная неизменяемая (иммутабельная) коллекция

# создание предварительно заполненного кортежа
tuple_1 = (10, 20, 30, 40, 50)
tuple_1 = tuple([1, 20, 3.14, "alisa"])
tuple_1 = tuple("hello, alisa")

# чтение значений
val_1 = tuple_1[-2]

# срез кортежа
slice_1 = tuple_1[2:5]
slice_1 = tuple_1[::-1]

# print(slice_1)

# Словарь (dict, dictionary)

# неупорядоченная изменяемая коллекция

# элемент словаря - пара "ключ-значение"

# создание пустого словаря 
dict_1 = {}
dict_1 = dict()

#создание предварительно заполненого словаря
dict_2 = {7:100, 0:3.14, "A":50, 'alisa':"rebrova", "кортеж":(3,2,1)}

lst_1 = [(20, 34), ('a', 'r'), (2, dict_2)]
dict_3 = dict(lst_1)

dict_3 = dict(a=100, b=200)

# чтение значений
val_1 = dict_2[0]
val_1 = dict_2['кортеж']

# добавление целой пары
dict_2['B'] = 777
dict_2['C'] = 'hello'

# замена значения
dict_2['A'] = 100

# удаление пары
del dict_2['B']
# del dict_2['C']

# методы
print(dict_2)

items_0 = list(dict_2.items())
values_0 = list(dict_2.values())
keys_0 = list(dict_2.keys())

val_2 = dict_2.pop('A')

print(val_2)
print(dict_2)

# дз методы кортежа
# дз остальные методы словаря
# множество (set)